mbeddedbk/V-f-control-based-on-stm32h735g-dk/Core/Src/main.c
		}

		if(counter > upperLimit)
		{
			counter = 0;
		}


		indx++;
		if(indx == 200)
		{
			rpm_ref = angularFrq*60/TWO_PI;
			speed = (position - oldpos) * 25; // speed in clicks/sec


		/*	if(rpm_ref <= 400)
				fl_rpm = (1.0063*((0.0707304 * speed) - 8.75)) + offset;//(0.994 * ((0.0707304 * speed) - 8.75)) - 6.1246;//(1.0059 * ((0.0707304 * speed) - 8.75)) + 6.2507;//(1.04 * ((1.1335*((speed * 60))/1000.0) + 15.8)) -25.182; //1.1335*((speed * 60)/1000.0) + 15.8;
			else if(rpm_ref > 400 && rpm_ref <= 700)
				fl_rpm = (1.0063*((0.0707304 * speed) - 8.75)) + (offset - 20);
			else if(rpm_ref > 700 && rpm_ref < 900)
				fl_rpm = (1.0063*((0.0707304 * speed) - 8.75)) + (offset - 30);
			else
				fl_rpm = (1.0063*((0.0707304 * speed) - 8.75)) + (offset - 40); */

			//fl_rpm = (1.0063*(0.0707304 * speed)) + offset;
			fl_rpm = (1.0572 * SPEED_TO_RPM(speed)) - 2.1893;

			(rpm < 0) ? (rpm = 0, fl_rpm = 0.0) : (rpm = (int)fl_rpm);
			angularFrqEnc = (fl_rpm / 60.0f) * TWO_PI;

			newAvgRpm = movingAvg(arrNumbers, &sum, pos, len, rpm);
		    pos++;
		    if (pos >= len){
		      pos = 0;
		    }

			if(piUsed == 1)
			{
				temp_pi_control = pi_control(&angularFreqPI, angularFrq - angularFrqEnc);
				PI_angularFrq = angularFrqEnc + temp_pi_control;
				limitAngFrq();
				setModulationIndex();
				if(angularFrq != 0) adjustMIAndFreqforPI(DIVIDE_BY_TWO_PI(PI_angularFrq), modulationIndex);
				else if (angularFrq == 0) adjustMIAndFreqforPI(DIVIDE_BY_TWO_PI(PI_angularFrq), 0);
			}
			oldpos = position;
			indx = 0;
		}

		//HAL_GPIO_WritePin(GPIOG, GPIO_PIN_5, GPIO_PIN_RESET);
	}
  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

